Heat Transfer/sphere_in_air_Finemesh_proper_air_value/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7
(
    maxY
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          1980;
        startFace       464004;
    }

    minX
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       465984;
    }

    maxX
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       466884;
    }

    minY
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          1980;
        startFace       467784;
    }

    minZ
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       469764;
    }

    maxZ
    {
        type            wall;
        inGroups        1 ( wall );
        nFaces          900;
        startFace       470664;
    }

    air_to_sphere
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          1536;
        startFace       471564;
        sampleMode      nearestPatchFace;
        sampleRegion    sphere;
        samplePatch     sphere_to_air;
    }

)


// ************************************************************************* //
